{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "[Ссылка на задание](https://stepik.org/lesson/264402/step/13?unit=245323)\n",
    "\n",
    "Дан треугольник ABC на плоскости, заданный координатами своих вершин. Для этого треугольника вычислить:\n",
    "\n",
    "* радиус вписанной в треугольник окружности;\n",
    "* радиус описанной вокруг треугольника окружности;\n",
    "* сумму длин трех медиан треугольника.\n",
    "\n",
    "\n",
    "## Формулы для вычислений\n",
    "\n",
    "Радиус вписанной в треугольник окружности:\n",
    "\n",
    "\n",
    "\\begin{equation}\n",
    "r =\\sqrt{\\frac{\\left(\\frac{p}{2}-a\\right)\\left(\\frac{p}{2}-b\\right)\\left(\\frac{p}{2}-c\\right)}{\\frac{p}{2}}}\n",
    "\\end{equation}\n",
    "\n",
    "\n",
    "```где a, b, c``` - длины сторон; ```p``` - периметр. \n",
    "\n",
    "Радиус описанной вокруг треугольника окружности:\n",
    "\n",
    "\\begin{equation}\n",
    "R = \\frac{a\\cdot b \\cdot c}{4 \\cdot s}\n",
    "\\end{equation}\n",
    "\n",
    "где ```s``` - площадь треугольника.\n",
    "\n",
    "Длины медиан треугольника:\n",
    "\n",
    "\\begin{equation}\n",
    "M_{a} = \\frac{1}{2} \\cdot \\sqrt{2 \\cdot \\left(c^{2} + b^{2}\\right) - a^{2}}\n",
    "\\end{equation}\n",
    "\n",
    "\\begin{equation}\n",
    "M_{b} = \\frac{1}{2} \\cdot \\sqrt{2 \\cdot \\left(a^{2} + c^{2}\\right) - b^{2}}\n",
    "\\end{equation}\n",
    "\n",
    "\\begin{equation}\n",
    "M_{c} = \\frac{1}{2} \\cdot \\sqrt{2 \\cdot \\left(a^{2} + b^{2}\\right) - c^{2}}\n",
    "\\end{equation}\n",
    "\n",
    "\n",
    "## Пояснения к реализации\n",
    "\n",
    "* Для решения использовать шаблон (скопировать код в соответствующее окно среды разработки, после комментариев вставить необходимые операторы).\n",
    "* Результаты вычислений (радиус вписанной окружности, радиус описанной окружности, сумму длин медиан) вывести без сообщений пользователю, в одном операторе ```print```, округлив значения до 4-х знаков после запятой.  \n",
    "* Если по заданным точкам построить треугольник нельзя, вывести ```\"error\".```\n",
    "\n",
    "## Входные данные:\n",
    "\n",
    "* вещественное число (координата **x** точки А);\n",
    "* вещественное число (координата **y** точки А);\n",
    "* вещественное число (координата **x** точки B);\n",
    "* вещественное число (координата **y** точки B);\n",
    "* вещественное число (координата **x** точки C);\n",
    "* вещественное число (координата **y** точки C).\n",
    "\n",
    "## Выходные данные:\n",
    "\n",
    "* радиус вписанной окружности, радиус описанной окружности и сумма длин медиан или **error**. Все значения округлить с указанной точностью, в операторе **print** никаких пояснений (текст в кавычках) не использовать.\n",
    "\n",
    "_____________________________________________________________________________________\n",
    "\n",
    "### Sample Input 1:\n",
    "\n",
    "    0  \n",
    "    0  \n",
    "    1\n",
    "    1\n",
    "    2\n",
    "    2\n",
    "_____\n",
    "\n",
    "### Sample Output 1:\n",
    "\n",
    "    error\n",
    "\n",
    "_____\n",
    "\n",
    "### Sample Input 2:\n",
    "\n",
    "    -12.8  \n",
    "    3.4  \n",
    "    -7.7  \n",
    "    8.6  \n",
    "    -14.6  \n",
    "    -3.5  \n",
    "\n",
    "____\n",
    "\n",
    "### Sample Output 2:\n",
    "\n",
    "    0.9113 14.0042 22.8319"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "x_a = -12.8\n",
      "y_a = 3.4\n",
      "x_b = -7.7\n",
      "y_b = 8.6\n",
      "x_c = -14.6\n",
      "y_c = -3.5\n",
      "0.9113 14.0042 22.8319\n"
     ]
    }
   ],
   "source": [
    "from math import sqrt\n",
    "\n",
    "def compute_len(x_0,y_0,x_1,y_1):\n",
    "    \n",
    "    len_line = sqrt((x_1 - x_0) ** 2 + (y_1 - y_0) ** 2)\n",
    "    \n",
    "    return len_line\n",
    "\n",
    "\n",
    "def compute_area(a_1, a_2, a_3):\n",
    "    \n",
    "    p = (a_1 + a_2 + a_3) / 2\n",
    "    \n",
    "    area = sqrt(p * (p - a_1) * (p - a_2) * (p - a_3))\n",
    "    \n",
    "    return area\n",
    "\n",
    "\n",
    "def compute_inscribed_circle(a_1, a_2, a_3):\n",
    "    \n",
    "    p = (a_1 + a_2 + a_3) / 2\n",
    "    \n",
    "    r = sqrt((p - a_1) * (p - a_2) * (p - a_3) / p)\n",
    "    \n",
    "    return r\n",
    "\n",
    "\n",
    "def compute_circumscribed_circle(a_1, a_2, a_3):\n",
    "    \n",
    "    s = compute_area(a_1, a_2, a_3)\n",
    "    \n",
    "    r = a_1 * a_2 * a_3 / (4 * s)\n",
    "    \n",
    "    return r\n",
    "\n",
    "\n",
    "def compute_median(a_1, a_2, a_3):\n",
    "    \n",
    "    M = sqrt(2 * (a_1 ** 2 + a_2 ** 2) - a_3 ** 2) / 2\n",
    "    \n",
    "    return M\n",
    "\n",
    "\n",
    "x_a = float(input())\n",
    "\n",
    "y_a = float(input())\n",
    "\n",
    "x_b = float(input())\n",
    "\n",
    "y_b = float(input())\n",
    "\n",
    "x_c = float(input())\n",
    "\n",
    "y_c = float(input())\n",
    "\n",
    "\n",
    "c = compute_len(x_a, y_a, x_b, y_b)\n",
    "\n",
    "a = compute_len(x_b, y_b, x_c, y_c)\n",
    "\n",
    "b = compute_len(x_a, y_a, x_c, y_c)\n",
    "\n",
    "\n",
    "if a + b <= c or b + c <= a or a +c <= b:\n",
    "    \n",
    "    print(\"error\")\n",
    "    \n",
    "else:     \n",
    "    \n",
    "    r = compute_inscribed_circle(a, b, c)\n",
    "    R = compute_circumscribed_circle(a, b ,c)\n",
    "    M_a = compute_median(c, b, a)\n",
    "    M_b = compute_median(a, c, b)\n",
    "    M_c = compute_median(a, b, c)\n",
    "    \n",
    "    print(round(r, 4), round(R, 4), round(M_a + M_b + M_c, 4), sep=' ')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
