{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "[Ссылка на задание](https://stepik.org/lesson/13259/step/5?unit=3444)\n",
    "\n",
    "## Задача на программирование: рюкзак\n",
    "\n",
    "Первая строка входа содержит целые числа  $1\\leq W\\leq10^{4}$ и  $1\\leq n\\leq300$ — вместимость рюкзака и число золотых слитков. Следующая строка содержит nn целых чисел $1\\leq w_{i},...w_{n} \\leq10^{5}$, задающих веса слитков. Найдите максимальный вес золота, который можно унести в рюкзаке.\n",
    "\n",
    "### Sample Input:   \n",
    "10 3   \n",
    "1 4 8   \n",
    "\n",
    "### Sample Output:\n",
    "9"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from bisect import bisect_left\n",
    "\n",
    "W, n = [int(i) for i in input().split()]\n",
    "w = sorted([int(i) for i in input().split()])\n",
    "\n",
    "# Число, которое будет хранить максимальный вес, помещающийся в рюкзак\n",
    "max_s = 0\n",
    "# Заводим словарь с комбинациями веса, которые мы можем поместить в рюкзак\n",
    "# Первое значение - это нулевой вес. Нулевой вес мы точно можем поместить.\n",
    "dict = {0: 1}\n",
    "\n",
    "# В отсортированном списке слитков, выбираем только те, которые точно поместятся в рюкзак, те, которые\n",
    "# больше, нам просто нет смысла рассматривать\n",
    "for i in range(bisect_left(sorted(w), W)):\n",
    "#     Заводим массив для новых комбинаций, так как нельзя на ходу увеличивать словарь dict - \n",
    "#     питон нам не позволит этого сделать в цикле, который проходит по ключам словаря\n",
    "    res = []\n",
    "    # Проходим по ключам словаря, то есть по тем комбинациям, которые у нас уже есть\n",
    "    for key in dict:\n",
    "        # Заводим новую комбинацию, а именно - берем тот вес, который уже можно поместить в рюкзаке + вес нового слитка\n",
    "        s = key + w[i]\n",
    "\n",
    "        if s <= W:\n",
    "            # Если новая комбинация меньше или равно вместимости рюкзака, до добавляем ее в массив,\n",
    "            # который позже перекочует в наш словарь\n",
    "            res.append(s)\n",
    "            if s > max_s:\n",
    "                # если новая комбинация больше, чем текущая максимальная - обновляем максимальную\n",
    "                # на самом деле, если наша комбинация УЖЕ равна W - вместимости рюкзака, то мы можем прерывать проверку,\n",
    "                # всё - ответ уже найден!!! Но мне лень переписывать\n",
    "                max_s = s\n",
    "    # добавляем новые комбинации в наш словарь\n",
    "    for k in res:\n",
    "        dict[k] = 1\n",
    "                \n",
    "print(max_s)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
